//Од тастатура се чита еден 2-цифрен број. Да се формира број чиј што цифри ќе бидат подредени од десно кон лево во растечки редослед
// и да се испечати на екран неговиот степен.
//Пример: Од бројот 12 треба да се формира бројот 21 и да се испечати на екран неговиот степен (441).
//Напомена: Бројот секогаш ќе е двоцифрен.

#include <stdio.h>
int main() {
    int a, c, p, temp;
    scanf("%d", &a);
    c = a % 10;
    p = a / 10;
    if (p > c) {
        printf("%d", a * a);
    } else if (c > p) {
        temp = c * 10 + p;
        printf("%d", temp * temp);
    } else if (p == c)
        printf("%d", (p * 10 + c) * (p * 10 + c));
    return 0;
}
