//Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.
//Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
// По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа, а истото важи и за редоследот на негативните.
//Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.
//Пример.
//Влез
//9 // бројот N на елементи
//1 3 -3 2 5 -7 9 0 3 // елементи на низата
//Излез
//1 3 2 5 0 3 -3 -7 -9 // добиената низа, после преместувањето

#include <stdio.h>
#define MAX 100
void premesti(int  *a, int n) {
    int tempP[MAX], tempN[MAX], final[MAX];
    int j = 0, k = 0, l = 0;
    for (int i = 0; i < n; i++) {
        if (a[i] >= 0) {
            tempP[j++] = a[i];
        } else
            tempN[k++] = a[i];
    }
    for (int i = 0; i < j; i++) {
        final[l++] = tempP[i];
    }
    for (int i = 0; i < k; i++) {
        final[l++] = tempN[i];
    }
    for (int i = 0; i < n; i++) {
        a[i] = final[i] ;
    }
}
int main(){
    int a[MAX], n;
    scanf("%d ",&n);
    for( int i = 0; i < n; i++) {
        scanf("%d ", &a[i]);
    }
    premesti(a,n);
    for( int i = 0; i < n; i++) {
        printf("%d ", a[i]);
    }
    return 0;
}