//Од тастатура се читаат непознат број на позитивни цели броеви (со максимум 5 цифри) се додека не се внесе нешто различно од број.
// За секој број треба да се најде позицијата (од десно на лево) на првото појавување на најголемата цифра во составот на бројот (цифрата на единици се наоѓа на позиција 0).
// Потоа, да се испечати статистика за позициите на најдените цифри со максимална вредност во следниот формат:
//[позиција]: [вкупно броеви чија максимална цифра се наоѓа на таа позиција]
//0: 2
//1: 3
//2: 1
//3: 1
//4: 1
//за броевите 97654 48654 12345 12343 1263 12443 12643 12777

#include <stdio.h>
int main()
{int br0=0,br1=0,br2=0,br3=0,br4=0;
    int number,temp2,max,position,maxposition;
    while(scanf("%d",&number)){
        temp2=number;
        max=0;
        position=0;
        while (temp2)
        {
            if(temp2%10>max){
                max=temp2%10;
                maxposition=position;
            }
            position++;
            temp2/=10;
        }
        if(maxposition==0)br0++;
        if(maxposition==1)br1++;
        if(maxposition==2)br2++;
        if(maxposition==3)br3++;
        if(maxposition==4)br4++;
    }
    printf("0: %d\n1: %d\n2: %d\n3: %d\n4: %d\n",br0,br1,br2,br3,br4);
    return 0;
}