//Со Морзеовата азбука, знаците (букви, цифри) се претставуваат со точки и цртички.
// Цифрите од 0 до 4 се претставуваат, соодветно, на следниот начин: "-----", ".----", "..---", "...--", "....-".
// Од тастатура се внесува даден природен број N (N<100 000), и потоа се внесуваат N други природни броеви.
// За секој од внесените броеви,во посебен ред, да се отпечати остатокот при делењето на тој број со 5 во Морзеов код.

#include <stdio.h>
int main()
{
    int N,i;
    scanf("%d",&N);
    for(i=0;i<N;i++){
        int n;
        scanf("%d",&n);
        if(n%5==0){
            printf("-----\n");
        }
        else if(n%5==1){
            printf(".----\n");
        }
        else if(n%5==2) {
            printf("..---\n");

        }
        else if(n%5==3){
            printf("...--\n");

        }
        else if(n%5==4){
            printf("....-\n");
        }
        else{
            break;}

    }
}

