//Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
//Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
//Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број,
// во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.
//Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)

#include <stdio.h>
int main()
{
    int a,b,temp,paren,c1;
    scanf("%d %d",&a,&b);
    if (a<=0 || b<=0)
        printf("Invalid input");
    else
    {
        if(a>b) {
            temp = a;
            a = b;
            b = temp;
        }
        paren=1;
        while(a) {
            c1 = a % 10;
            if (c1 != (b % 100 / 10)) {
                paren = 0;
            }
            else
            {a /= 10;
                b /= 100;}
            if (paren == 0) {
                break;
            }
        }
        if( a==0 && paren==1)
            printf("PAREN");
        else
            printf("NE");
    }
    return 0;
}