//Од стандарден влез се внесуваат два цели броја N и Х.
//Да се најде најблискот број помал од N коj е тотално различен од бројот Х.
//Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.
//Задачата да се реши без употреба на низи и матрици.

#include <stdio.h>
int main () {
    int N, X, tn, tx;
    int i, tr, c,t;
    scanf("%d", &N);
    scanf(("%d"), &X);
    for (i = (N - 1);; i--) {
        tn = i;
        t=0;
        while (tn) {
            c = tn % 10;
            tx = X;

            while (tx) {
                if (c != (tx % 10)) {
                    tx /= 10;
                }
                else {
                    t=1;
                    break;
                }
            }
            if(t==1){
                break;}
            tn /= 10;
        }
        if (tn==0) {
            printf("%d", i);
            break;
        }
    }
    return 0;
}