//Од стандарден влез да се прочита квадратна матриција со број на редици и колони N. Прво се вчитува бројот N а потоа и N*N елементите на матрицата.
//Да се промени знакот на елементите од главната дијагонала на матрицата (позитивните да станат негативни и обратно).
//Да се испечати трансформираната матрица на екран (Секој елемент од матрицата се печати со 3 места - %3d).

#include <stdio.h>
int main()
{
    int N,i,j,matrix[100][100];
    scanf("%d", &N);
    for(i=0;i<N;i++){
        for(j=0;j<N;j++){
            scanf("%d",&matrix[i][j]);
        }
    }
    for(i=0;i<N;i++){
        for(j=0;j<N;j++){
            if(i==j){
                matrix[i][j]*=(-1);
            }
        }
    }
    for(i=0;i<N;i++){
        for(j=0;j<N;j++){
            printf("%3d ", matrix[i][j]);
        }
        printf("\n");
    }
    return 0;
}