//Од тастатура се внесува низа од целобројни елементи А со должина N ( N <= 100). Дополнително се внесува и број К.
//Да се трансформира низата така што на почеток ќе се преместат сите елементи помали од K, а после нив ќе следуваат броевите поголеми или еднакви на K.
//Редоследот на елементите да не се менува.
//Испечатете ги елементите на трансформираната низа во еден ред на стандарден излез разделени со празно место.

#include <stdio.h>
int main ()
{
    int i,n;
    int k,j;
    int niza[100];
    scanf("%d",&n);
    int Copy[100];
    for (i=0;i<n;i++){
        scanf("%d",&niza[i]);
    }
    scanf("%d",&k);
    j=0;
    for (i=0;i<n;i++) {
        if (niza[i] < k) {
            Copy[j]=niza[i];
            j++;
        }
    }
    for (i=0;i<n;i++) {
        if (niza[i] >= k) {
            Copy[j]=niza[i];
            j++;
        }
    }
    for (i=0;i<n;i++) {
        printf("%d ", Copy[i]);
    }
    return 0;
}