//Да се имплементира рекурзивна функција која за низа од цели броеви $[a{0}, a{1}, ..., a_{n-1}]$ ќе ја пресмета вредноста на непрекинатата дропка дефинирана како:
//
//v=a0 + 1/a1+...1/a_(n−2)+1_(an−1)
//
//Да се напише програма во која се чита цел број N, по што се читаат елементите на низа од N цели броеви (не повеќе од 100).
// Потоа се повикува рекурзивната функција и се печати резултатот во нов ред.

#include <stdio.h>

double neprekinata_dropka(int *a, int n, int i){
    if((n-1)==i)
        return a[i];
    return a[i] + (double)1/neprekinata_dropka(a, n, i+1);
}

int main(){
    int n, a[100];
    scanf("%d", &n);
    for(int i = 0; i <n; i++){
        scanf("%d", &a[i]);
    }
    printf("%lf", neprekinata_dropka(a,n,0));
    return 0;
}