//Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8).
// Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура),
// да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.

#include <stdio.h>
int main(){
    int p,k,broj,a,i;
    scanf("%d%d",&p,&k);
    for(i=p;i<=k;i++){
        broj=i;
        a=broj;
        while(broj!=0){
            if(broj%10==0 || broj%10==2 ||broj%10==4 ||broj%10==6 ||broj%10==8)
                broj/=10;
            else{
                break;

            }
        }
        if(broj==0){
            printf("%d\n",a);
            break;}
    }
    if(i>k)
        printf("NE");
    return 0;
}