//Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).
//Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
//Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот.
// Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

#include <stdio.h>
int main(){
    int r,k, index1,index2;
    int a[100][100];
    int kvadranti[4];
    scanf("%d%d" ,&r,&k);
    for(int i=0; i < r ; i++){
        for(int j = 0; j < k; j++){
            scanf("%d",&a[i][j]);
        }
    }
    scanf("%d%d", &index1, &index2);
    for(int i=0; i < index1; i++){
        for(int j = index2; j < k; j++){
            kvadranti[0] += a[i][j];
        }
        for(int j = 0; j < index2; j++){
            kvadranti[1] += a[i][j];
        }
    }
    for(int i = index1 ; i < r; i++){
        for(int j = 0; j < index2; j++){
            kvadranti[2] += a[i][j];
        }
        for(int j = index2; j < k; j++){
            kvadranti[3] += a[i][j];
        }
    }
    for( int i=0; i < 4;i++)
        printf("%d ",kvadranti[i]);
    return 0;
}