//Од стандарден влез се вчитува матрица сo n редици и n колони. Прво се вчитува бројот n потоа и елементите на матрицата.
// Матрицата треба да се трансформира така што секој елемент што се наоѓа десно од споредната дијагонала од истата редица и е помал
// од просекот на елементите лево од споредната дијагонала од истата редица треба да се замени со -1. Вака трансформираната матрица да се испечати на екран.

//Објаснување на примерот:
//2 3 5 9
//7 8 4 2
//4 2 3 5
//7 10 9 2
//Пример за втората редица, елементот од споредната дијагонала е 4, лево од него се 7 и 8, нивен просек е 7.5 , десно од него е 2, 2 е помал од 7.5 и затоа се заменува со -1.

#include <stdio.h>
int main()
{
    int n,i,j,matrix[100][100];
    int counter;
    float sum;
    float average;
    scanf("%d", &n);
    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            scanf("%d",&matrix[i][j]);
        }
    }
    for(i=0;i<n;i++){
        counter=0;
        sum=0;
        for(j=0;j<n;j++){
            if(i+j<n-1){
                sum+=matrix[i][j];
                counter++;
            }
            if(i+j>n-1){
                if(matrix[i][j]<sum/counter){
                    matrix[i][j]=-1;
                }
            }
            if(i+j==n-1){
                average=sum/counter;

            }
        }
    }
    for(i=0;i<n;i++){
        for(j=0;j<n;j++){
            printf("%d ",matrix[i][j]);
        }
        printf("\n");
    }
    return 0;
}
